{
    "recipes": [
        {
            "id": "6B858FCD-3BF9-4EE0-A9DF-9B95011C3175",
            "name": "Crispy Baked Polenta Sticks with Ranch Dip",
            "image": "https://www.forksoverknives.com/wp-content/uploads/fly-images/141070/fancy-vegan-meatballs-appetizer-360x270-c.jpg",
            "description": "Seasoned polenta sticks are rolled in bread crumbs and baked to crispy perfection for a deliciously dip-friendly snack. This recipe includes instructions for an easy homemade vegan Ranch Dip, but you can also substitute warmed marinara sauce to keep things easy. This recipe makes for a great Thanksgiving appetizer or a tasty midday treat to tide you over until dinner time.",
            "ingredients": "2 cups unsweetened, unflavored plant-based milk\n1 cup dry polenta\n¼ cup nutritional yeast\n1 tablespoon flaxseed meal\n4½ teaspoons white wine vinegar\n1½ teaspoons lemon juice\n2 teaspoons garlic powder\n½ teaspoon sea salt\n¼ teaspoon freshly ground black pepper\n1 cup whole wheat bread crumbs\n1 12-oz. package soft silken tofu (or 1 15-oz. can cannellini beans, rinsed and drained)\n2 teaspoons onion powder\n2 teaspoons chopped fresh parsley (or ½ teaspoon dried parsley)\n2 teaspoons chopped fresh dill (or ½ teaspoon dried dill weed)\n2 teaspoons chopped fresh chives (or ½ teaspoon dried chives)",
            "directions": "In a medium saucepan bring milk and 2 cups water to boiling. Gradually whisk in polenta. Reduce heat to low; cook 25 minutes or until thick and creamy, stirring frequently. Add in nutritional yeast, flaxseed meal, 3 teaspoons white wine vinegar, the lemon juice, ½ teaspoon garlic powder, ½ teaspoon sea salt, and ¼ teaspoon black pepper; mix well. Cook and stir 3 minutes more.\nOn a baking sheet spread polenta mixture into an 8×6-inch rectangle that is ½ inch thick. Let cool 5 minutes. Cover and chill for at least 1 and up to 12 hours.\nFor Ranch Dip, in a blender combine the tofu, onion powder, and the remaining 1½ teaspoons each garlic powder and vinegar. Cover and blend until smooth and creamy. Season with salt and pepper to taste, and pulse to combine. Transfer dip to a bowl and stir in parsley, dill, and chives. Chill 1 hour before serving.\nPreheat oven to 350°F. Slice chilled polenta in half lengthwise to make two long rectangles. Slice crosswise to divide each rectangle into 16 half-inch-thick sticks, for a total of 32 sticks.\nPlace bread crumbs in a shallow bowl. Dredge polenta sticks in crumbs until well coated. Arrange sticks on a baking sheet, spacing them at least ½ inch apart. Bake 20 minutes or until polenta sticks are crispy. Serve right away with Ranch Dip.",
            "category": "Snack",
            "datePublished": "2021-11-09",
            "url": "https://www.forksoverknives.com/recipes/vegan-snacks-appetizers/crispy-baked-polenta-sticks-ranch-dip/",
            "cookTime": "30",
            "isFavorite": false,
            "recipeType": ["New", "Vegetarian"]
        },
        {
            "id": "1D81D088-D03E-4DB8-8695-58F9A42A2386",
            "name": "Sun-Dried Tomato and Caramelized-Onion Focaccia",
            "image": "https://www.forksoverknives.com/wp-content/uploads/fly-images/103976/focaccia-for-wordpress-360x270-c.jpg",
            "description": "Focaccia is like a freestyle pizza. It’s perfect for parties because it can be served in any-size pieces (small squares to large slabs) and warm or at room temperature. Learn more about flatbreads and pizzas with our handy guide to plant-based pizza.",
            "ingredients": "1 tablespoon date paste\n1 tablespoon active dry yeast\n1½ cups all-purpose flour\n½ cup potato flour\n½ cup white whole wheat flour\n½ cup cornmeal\n½ teaspoon sea salt\n2 cups thinly sliced onions\n½ cup thinly sliced sun-dried tomatoes (not oil-packed)\n⅓ cup pickled jalapeños, chopped (optional)\n⅓ cup chopped olives (optional)",
            "directions": "IFor sponge, in a small bowl stir together ⅔ cup warm water and the date paste. Sprinkle in the yeast and ½ cup of the all-purpose flour; stir to combine. Cover bowl and let stand in a warm place 25 minutes.\nIn a separate bowl stir together potato flour and 1 cup water. Add the remaining 1 cup all-purpose flour, the whole wheat flour, cornmeal, salt, and ⅓ cup warm water. Add the sponge; mix well. Transfer dough to a floured work surface. Form dough into a ball and knead lightly 2 to 3 minutes or until soft and sticky.\nReturn dough to bowl; cover with a damp cloth. Let rise in a warm place 1 hour or until double in size.\nMeanwhile, in a medium saucepan cook onions with ¼ cup water over medium heat about 10 minutes or until starting to turn translucent, stirring frequently and adding water, 1 to 2 Tbsp. at a time, as needed to prevent sticking.\nSoak sun-dried tomatoes in ½ cup water 20 minutes or until soft; drain.\nPreheat oven to 475°F. Line a 13×9-inch baking pan with parchment paper.\nPunch down dough. On a lightly floured surface, roll dough into a ½-inch-thick rectangle. Transfer dough to the prepared baking pan. Top evenly with onions, tomatoes, and, if desired, jalapeños and olives.\nLet focaccia stand 15 minutes. Bake 30 minutes or until golden brown.",
            "category": "Main",
            "datePublished": "2020-01-07",
            "url": "https://www.forksoverknives.com/recipes/vegan-baked-stuffed/sun-dried-tomato-and-caramelized-onion-focaccia/",
            "cookTime": "163",
            "isFavorite": false,
            "recipeType": ["New", "Vegetarian"]
        },
        {
            "id": "1D81D088-D03E-4DB8-8695-58F9A42A2387",
            "name": "Moroccan Chickpea-Potato Tagine",
            "image": "https://www.forksoverknives.com/wp-content/uploads/fly-images/159826/Moroccan-Chickpea-Potato-Tagine-wordpress-375x173-c.jpg",
            "description": "This hearty Moroccan tagine is delicious served over couscous or any other hot cooked whole grains you enjoy. Potatoes and chickpeas soak up the fragrant flavors of fresh ginger and ras el hanout (look for the spice blend at Middle Eastern markets or make your own using our easy Ras el Hanout recipe) to create a savory plant-based stew that warms you up from the inside out.  Chopped dried apricots add pockets of sweetness throughout the dish while sliced lemon rind brings bright acidity to the hearty ingredients. Tagines are traditionally slow-cooked in an earthenware vessel of the same name, but a large, heavy-duty sauté pan with a lid will do the trick for this recipe.",
            "ingredients": "1 cup finely chopped yellow onion\n4 cloves garlic, minced\n2 teaspoons grated fresh ginger\n4 tomatoes, peeled, seeded, and chopped (3 cups)\n2 tablespoons ras el hanout spice blend\n2 tablespoons roughly chopped fresh cilantro\n¼ cup chopped dried apricots\n2 tablespoons finely chopped lemon rind\n½ teaspoon sea salt\n¼ teaspoon freshly ground black pepper\n2 15-oz. cans chickpeas (garbanzo beans), rinsed and drained\n1½ lb. Yukon gold potatoes, peeled and cut into 1½-inch pieces (4 cups)",
            "directions": "In a 10-inch sauté pan or large deep skillet combine onion, garlic, ginger, and ¼ cup water. Cook over medium 10 minutes or until onion is tender, stirring occasionally. Add tomatoes, ras el hanout, and 1 tablespoon of the cilantro. Cook and stir 2 minutes. Stir in the next four ingredients (through pepper). Bring to boiling; reduce heat. Cover and simmer 10 minutes. Turn off heat.\nStir in chickpeas. Lay potatoes over top in a single layer. Cover and cook over medium low 15 to 20 minutes or until potatoes are just tender but not mushy. Sprinkle with the remaining cilantro.\nServe tagine over couscous or other hot cooked whole grains. When spooning tagine out of pan, carefully scoop the vegetables without stirring them. Spoon sauce from the bottom of the pan over vegetables.",
            "category": "Main",
            "datePublished": "2022-02-16",
            "url": "https://www.forksoverknives.com/recipes/moroccan-chickpea-potato-tagine/",
            "cookTime": "90",
            "isFavorite": false,
            "recipeType": ["New"]
        },
        {
            "id": "1D81D088-D03E-4DB8-8695-58F9A42A2388",
            "name": "Butternut Cream Farfalle with Black Beans and Pumpkin Seeds",
            "image": "https://www.forksoverknives.com/wp-content/uploads/fly-images/159989/Butternut-Cream-Farfalle-with-Black-Beans-and-Pumpkin-Seeds-wordpress-1366x566-c.jpg",
            "description": "Craving a meal that’s creamy, hearty, and crunchy all at the same time? This is the dish for you. Earthy butternut squash is simmered with savory spices and puréed into a velvety sauce that’s made even richer with a dollop of almond butter. Nutrient-dense black beans add substance, while roasted pumpkin seeds serve as a crunchy garnish that makes every bite the perfect combination of textures and flavors. Sprinkle the finished dish with paprika (or cayenne, if you prefer a little more spice), and dig into this delectable and healthy plant-based pasta.",
            "ingredients": "2 10-oz. bags frozen butternut squash cubes\n1 small onion, quartered\n2 cloves garlic\n1 tablespoon tomato paste\n1 teaspoon curry powder\n½ teaspoon dried oregano\n8 oz. dry whole wheat farfalle or bow tie pasta\n1 15-oz. can black beans, rinsed and drained (1½ cups)\n1 tablespoon almond butter\nSea salt, to taste\nFreshly ground black pepper, to taste\n¼ cup unsalted roasted pumpkin seeds (optional)\nSmoked paprika (optional)",
            "directions": "In a medium saucepan combine the first six ingredients (through oregano) with 1½ cups water. Cover and bring to boiling. Cook about 10 minutes or until squash is very tender.\nCook farfalle according to package directions for al dente, adding beans the last 1 minute of cooking.\nMeanwhile, transfer squash mixture and almond butter to a food processor. Process to a smooth sauce. Season with salt and pepper.\nDrain pasta and beans; return to pot. Add sauce, stirring to coat. If desired, sprinkle with pumpkin seeds and paprika.",
            "category": "Main",
            "datePublished": "2022-03-07",
            "url": "https://www.forksoverknives.com/recipes/vegan-pasta-noodles/butternut-cream-farfalle-black-beans-pumpkin-seeds/",
            "cookTime": "20",
            "isFavorite": false,
            "recipeType": ["New", "Vegetarian"]
        },
        {
            "id": "1D81D088-D03E-4DB8-8695-58F9A42A2389",
            "name": "Creamy Roasted Cauliflower Soup",
            "image": "https://www.forksoverknives.com/wp-content/uploads/fly-images/159964/Roasted-Cauliflower-Soup-wordpress-1366x566-c.jpg",
            "description": "This mellow-flavored cauliflower soup is pure comfort in a bowl. Hearty potatoes are puréed with the cauliflower into a velvety texture and enhanced with the warming flavors of nutmeg and cayenne. The garnish of roasted florets and fresh herbs adds a delicious contrasting texture to the creamy soup—not to mention a restaurant-quality presentation! Enjoy this recipe as a light lunch or add some heft by serving it alongside a grilled sandwich or salad.",
            "ingredients": "1 2-lb. head cauliflower, cut into florets (6 cups)\n2 medium russet potatoes, peeled and cubed (2 cups)\n1 cup chopped sweet onion\n4 cloves garlic\n3 to 4 tablespoons white wine vinegar\n4 cups low-sodium vegetable broth\n½ teaspoon freshly grated nutmeg\n¼ teaspoon cayenne pepper\nChopped fresh herbs, such as parsley, thyme, or basil\bFreshly ground black pepper, to taste",
            "category": "Soup",
            "datePublished": "2022-03-04",
            "url": "https://www.forksoverknives.com/recipes/vegan-soups-stews/creamy-roasted-cauliflower-soup/,
            "cookTime": "75",
            "isFavorite": false,
            "recipeType": ["New", "Vegetarian"]
        }
    ]
}
